from django.db import models

# class Name(models.Model):
#     id   = models.AutoField(primary_key=True)
#     name = models.CharField(max_length=200)

class PreModelUpdateTime(object):

    def __init__(self, time_str):
        self.time = time_str

    def to_dict(self):

        dest = {
            u'pre_update_time':self.time
        }

        return dest


# class Info(object):
    
#     def __init__(self,n):
#         self.number = n

#     def to_dict(self):

#         dest = {
#             u'number': self.number
#         }

#         return dest


# 아메리카노
# ['에스프레소','담백','카페인','물']

# 카페라떼
# '에스프레소','담백','카페인','우유'

# 카푸치노
# '에스프레소','담백','카페인','우유'

# 카페모카
# '에스프레소','달콤','카페인','우유'

# 바닐라 라떼
# '에스프레소','달콤','카페인','우유'

# 헤즐넛라떼
# '에스프레소','달콤','카페인','우유'

# 카라멜 마끼야또
# '에스프레소','달콤','카페인','우유'

# 사케타로
# '에스프레소','카페인'

# 스노우 아메리카노
# '에스프레소스페셜','달콤','카페인','물'

# 밀어라떼
# '에스프레소스페셜','카페인','우유'

# 코코넛 커피 스무디
# '에스프레소스페셜','달콤','카페인','스무디'

# 오렌지라떼
# '에스프레소스페셜','달콤','카페인','우유','과일'

# 자몽라떼
# '에스프레소스페셜','달콤','카페인','우유','과일'

# 티라미슈 라떼
# '에스프레소스페셜','달콤','카페인','우유'

# 더치아메리카노
# '콜드브루','담백','카페인'

# 더치라떼 더치휴브라떼
# '콜드브루','담백','카페인','우유'

# 케냐
# '드립커피','담백','카페인'

# 예자체크
# '드립커피','담백','카페인'

# 콜롬비아
# '드립커피','담백','카페인'

# 과테말라
# '드립커피','담백','카페인'

# 브라질
# '드립커피','담백','카페인'

# 오늘의 원두
# '드립커피','담백','카페인'

# 더블카카오
# '라떼','담백','카페인'

# 말차그린티라떼
# '라떼','달콤','카페인','우유'

# 생강라떼
# '라떼','달콤','차','우유'

# 밀크티
# '라떼','담백','차','우유'

# 레몬
# '에이드','달콤','주스','과일'

# 자몽
# '에이드','달콤','주스','과일'

# 코코넛
# '스무디','달콤','주스'

# 쿠키크림
# '스무디','달콤','주스'

# 플레인요거트
# '스무디','달콤','주스','요거트'

# 레몬 요거트
# '요거트','스무디','달콤','주스','과일'

# 청포도
# '프레시','달콤','주스','과일'

# 바나나
# '프레시','달콤','주스','과일'

# 사과바나나
# '프레시','달콤','주스'

# 루이스보스바닐라
# '차','담백'

# 레몬그라스
# '차','담백'

# 포스칼카비스커스
# '차','담백'

